irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_wwdg_5891_IUT.c
  tmpreg |= WindowValue & (uint32_t) ((uint8_t)0x7F);


  ((WWDG_TypeDef *) (((uint32_t)0x40000000) + 0x2C00))->CFR = tmpreg;

CS_CMM_PROBE_NODE_STMT(241,3,1) 
 CODESCROLL_FUNC_END(468, 24, 151) } CODESCROLL_FUNC_END_RBRACE 






void WWDG_EnableIT(void)
{ CODESCROLL_FUNC_BEGIN(469, (469, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1162,1064) 
  
  CS_CMM_PROBE_NODE_STMT(241,2,0) *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x2C00) - ((uint32_t)0x40000000)) + 0x04) * 32) + (0x09 * 4)) = (uint32_t)ENABLE;

CS_CMM_PROBE_NODE_STMT(241,1,1) 
 CODESCROLL_FUNC_END(469, 24, 161) } CODESCROLL_FUNC_END_RBRACE 







void WWDG_SetCounter(uint8_t Counter)
{ CODESCROLL_FUNC_BEGIN(470, (470, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1163,1065) 

  
  CS_CMM_PROBE_NODE_STMT(241,0,0) ((void)0);


  ((WWDG_TypeDef *) (((uint32_t)0x40000000) + 0x2C00))->CR = Counter & ((uint8_t)0x7F);

CS_CMM_PROBE_NODE_STMT(242,7,1) 
 CODESCROLL_FUNC_END(470, 24, 176) } CODESCROLL_FUNC_END_RBRACE 







void WWDG_Enable(uint8_t Counter)
{ CODESCROLL_FUNC_BEGIN(471, (471, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1164,1066) 

  
  CS_CMM_PROBE_NODE_STMT(242,6,0) ((void)0);
  ((WWDG_TypeDef *) (((uint32_t)0x40000000) + 0x2C00))->CR = ((uint32_t)0x00000080) | Counter;

CS_CMM_PROBE_NODE_STMT(242,5,1) 
 CODESCROLL_FUNC_END(471, 24, 189) } CODESCROLL_FUNC_END_RBRACE 






FlagStatus WWDG_GetFlagStatus(void)
{ CODESCROLL_FUNC_BEGIN(472, (472, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1165,1067) 
  
  CS_CMM_PROBE_NODE_STMT(242,4,0) 
  CS_CMM_PROBE_NODE_STMT(242,3,1) 
   CODESCROLL_FUNC_END(472, 24, 198) return (FlagStatus)(((WWDG_TypeDef *) (((uint32_t)0x40000000) + 0x2C00))->SR);
} CODESCROLL_FUNC_END_RBRACE 






void WWDG_ClearFlag(void)
{ CODESCROLL_FUNC_BEGIN(473, (473, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1166,1068) 
  
  CS_CMM_PROBE_NODE_STMT(242,2,0) ((WWDG_TypeDef *) (((uint32_t)0x40000000) + 0x2C00))->SR = (uint32_t)RESET;

CS_CMM_PROBE_NODE_STMT(242,1,1) 
 CODESCROLL_FUNC_END(473, 24, 209) } CODESCROLL_FUNC_END_RBRACE 
